app/Http/Forms/UserForm.php

select * from `professions` order by `title` asc
select * from `skills` order by `name` asc
---
    public function toResponse($request)
    {
        return view($this->view, [
            'user' => $this->user,
            'professions' => Profession::orderBy('title', 'asc')->get(),
            'skills' => Skill::orderBy('name', 'asc')->get(),