app/Http/Controllers/UserController.php

select * from `skills` order by `name` asc
---
    public function index(Request $request, UserFilter $filters, Sortable $sortable)
    {
        $users = User::query()
            ->with('team', 'skills', 'profile.profession')
            ->withLastLogin()
            ->onlyTrashedIf($request->routeIs('users.trashed'))
            ->applyFilters()
            ->orderByDesc('created_at')
            ->paginate();

        $sortable->appends($users->parameters());

        return view('users.index', [
            'users' => $users,
            'view' => $request->routeIs('users.index') ? 'index' : 'trash',
            'skills' => Skill::orderBy('name')->get(),